schreibfaul1/ESP32-audioI2S/src/Audio.h
  private:
    // ------- PRIVATE MEMBERS ----------------------------------------
    std::unique_ptr<Decoder> createDecoder(const std::string& type);
    void                     destroy_decoder();
#ifdef AUDIO_ENABLE_FS
    bool                     fsRange(uint32_t range);
#endif
    void                     latinToUTF8(ps_ptr<char>& buff, bool UTF8check = true);
    void                     htmlToUTF8(char* str);
    void                     setDefaults(); // free buffers and set defaults
    int32_t                  audioFileRead(uint8_t* buff = nullptr, size_t len = 0);
    int32_t                  audioFileSeek(uint32_t position, size_t len = 0);
    void                     initInBuff();
    bool                     httpPrint(const char* host);
    bool                     httpRange(uint32_t range, uint32_t length = UINT32_MAX);
#ifdef AUDIO_ENABLE_FS
    void                     processLocalFile();
#endif
    void                     processWebStream();
    void                     processWebFile();
    void                     processWebStreamTS();
    void                     processWebStreamHLS();
    void                     playAudioData();
    bool                     readPlayListData();
    const char*              parsePlaylist_M3U();
    const char*              parsePlaylist_PLS();
    const char*              parsePlaylist_ASX();
    ps_ptr<char>             parsePlaylist_M3U8();
    uint16_t                 accomplish_m3u8_url();
    int16_t                  prepare_first_m3u8_url(ps_ptr<char>& playlistBuff);
    ps_ptr<char>             m3u8redirection(uint8_t* codec);
    void                     showCodecParams();
    int                      findNextSync(uint8_t* data, size_t len);
    uint32_t                 decodeError(int8_t res, uint8_t* data, int32_t bytesDecoded);
    uint32_t                 decodeContinue(int8_t res, uint8_t* data, int32_t bytesDecoded, int32_t* bytesLeft);
    int                      sendBytes(uint8_t* data, size_t len);
    void                     setDecoderItems();
    void                     calculateAudioTime(uint16_t bytesDecoderIn, uint16_t bytesDecoderOut);
    void                     showID3Tag(const char* tag, const char* val);
    size_t                   readAudioHeader(uint32_t bytes);
#ifdef AUDIO_CODEC_WAV
    int                      read_WAV_Header(uint8_t* data, size_t len);
#endif
#ifdef AUDIO_CODEC_FLAC
    int                      read_FLAC_Header(uint8_t* data, size_t len);
#endif
#if defined(AUDIO_CODEC_MP3) || defined(AUDIO_CODEC_AAC)
    int                      read_ID3_Header(uint8_t* data, size_t len);
#endif
#ifdef AUDIO_CODEC_M4A
    int                      read_M4A_Header(uint8_t* data, size_t len);
#endif
    size_t                   process_m3u8_ID3_Header(uint8_t* packet);
    bool                     setSampleRate(uint32_t hz);
    bool                     setBitsPerSample(int bits);
    bool                     setChannels(int channels);
    size_t                   resampleTo48kStereo(const int16_t* input, size_t inputFrames);
    void                     playChunk();
    void                     computeVUlevel(int16_t sample[2]);
    void                     computeVUlevel1(int32_t* sample);
    void                     computeLimit();
    void                     Gain(int16_t* sample);
    void                     Gain1(int32_t* sample);
    void                     showstreamtitle(char* ml);
    bool                     parseContentType(char* ct);
    bool                     parseHttpResponseHeader();
    bool                     parseHttpRangeHeader();
    bool                     initializeDecoder();
    esp_err_t                I2Sstart();
    esp_err_t                I2Sstop();
    void                     zeroI2Sbuff();
    void                     reconfigI2S();
    void                     IIR_filterChain0_s16(int16_t* iir_in, bool clear = false);
    void                     IIR_filterChain1_s16(int16_t* iir_in, bool clear = false);
    void                     IIR_filterChain2_s16(int16_t* iir_in, bool clear = false);
    void                     IIR_filterChain0_s32(int32_t* iir_in, bool clear = false);
    void                     IIR_filterChain1_s32(int32_t* iir_in, bool clear = false);
    void                     IIR_filterChain2_s32(int32_t* iir_in, bool clear = false);
    uint32_t                 streamavail() { return m_client ? m_client->available() : 0; }
    void                     IIR_calculateCoefficients(int8_t G1, int8_t G2, int8_t G3);
    bool                     ts_parsePacket(uint8_t* packet, uint8_t* packetStart, uint8_t* packetLength);
    uint64_t                 getLastGranulePosition();

    //+++ create a T A S K  for playAudioData(), output via I2S +++
  public:
    void     setAudioTaskCore(uint8_t coreID);
    uint32_t getHighWatermark();

  private:
    void        startAudioTask(); // starts a task for decode and play
    void        stopAudioTask();  // stops task for audio
    static void taskWrapper(void* param);
    void        audioTask();
    void        performAudioTask();

    //+++ H E L P   F U N C T I O N S +++
    bool         readMetadata(uint16_t b, uint16_t* readedBytes, bool first = false);
    int32_t      getChunkSize(uint16_t* readedBytes, bool first = false);
    bool         readID3V1Tag();
    int32_t      newInBuffStart(int32_t resumeFilePos);
#ifdef AUDIO_ENABLE_FS
#endif
    boolean      streamDetection(uint32_t bytesAvail);
    uint32_t     m4a_correctResumeFilePos();
    uint32_t     ogg_correctResumeFilePos();
    int32_t      flac_correctResumeFilePos();
    int32_t      mp3_correctResumeFilePos();
    int32_t      wav_correctResumeFilePos();
    uint8_t      determineOggCodec();
    void         strlower(char* str);
    void         trim(char* str);
    bool         startsWith(const char* base, const char* str);
    bool         endsWith(const char* base, const char* searchString);
    int          indexOf(const char* base, const char* str, int startIndex = 0);
    int          indexOf(const char* base, char ch, int startIndex = 0);
    int          lastIndexOf(const char* haystack, const char* needle);
    int          lastIndexOf(const char* haystack, const char needle);
    int          specialIndexOf(uint8_t* base, const char* str, int baselen, bool exact = false);
    int          specialIndexOfLast(uint8_t* base, const char* str, int baselen);
    int          find_utf16_null_terminator(const uint8_t* buf, int start, int max);
    int32_t      min3(int32_t a, int32_t b, int32_t c);
    uint64_t     bigEndian(uint8_t* base, uint8_t numBytes, uint8_t shiftLeft = 8);
    bool         b64encode(const char* source, uint16_t sourceLength, char* dest);
    void         vector_clear_and_shrink(std::vector<ps_ptr<char>>& vec);
    void         deque_clear_and_shrink(std::deque<ps_ptr<char>>& deq);
    uint32_t     simpleHash(const char* str);
    ps_ptr<char> urlencode(const char* str, bool spacesOnly);
    uint32_t     bswap32(uint32_t x);
    uint64_t     bswap64(uint64_t x);

